# Дан многомерный список в котором находится результат игры в крестики нолики,
# выяснить какой игрок победил (x или o), если никто не победил вывести "Ничья".
# Необходимо учитывать то, что есть разные выигрышные варианты и программа должна их распознавать.

import numpy

a = numpy.array([[0, 1, 1],
                 [1, 0, 0],
                 [0, 1, 1]])

if a[0, 0] == a[0, 1] == a[0, 2] == 1 or \
   a[1, 0] == a[1, 1] == a[1, 2] == 1 or \
   a[2, 0] == a[2, 1] == a[2, 2] == 1 or \
   a[0, 0] == a[1, 0] == a[2, 0] == 1 or \
   a[0, 1] == a[1, 1] == a[2, 1] == 1 or \
   a[0, 2] == a[1, 2] == a[2, 2] == 1 or \
   a[0, 0] == a[1, 1] == a[2, 2] == 1 or \
   a[0, 2] == a[1, 1] == a[2, 0] == 1:

 print('victory 1')

elif a[0, 0] == a[0, 1] == a[0, 2] == 0 or \
   a[1, 0] == a[1, 1] == a[1, 2] == 0 or \
   a[2, 0] == a[2, 1] == a[2, 2] == 0 or \
   a[0, 0] == a[1, 0] == a[2, 0] == 0 or \
   a[0, 1] == a[1, 1] == a[2, 1] == 0 or \
   a[0, 2] == a[1, 2] == a[2, 2] == 0 or \
   a[0, 0] == a[1, 1] == a[2, 2] == 0 or \
   a[0, 2] == a[1, 1] == a[2, 0] == 0:

 print('victory 0')

else:
 print('draw')