# Дан многомерный список в котором находится результат игры в крестики нолики,
# выяснить какой игрок победил (x или o), если никто не победил вывести "Ничья".
# Необходимо учитывать то, что есть разные выигрышные варианты и программа должна их распознавать.

a = [
    [0, 4, 9],
    [6, 6, 6],
    [8, 5, 0]
    ]

for i in range(len(a)):
    for j in range(len(a[i])):
        if a[0][0] == a[0][1] == a[0][2] == 0 or \
              a[1][0] == a[1][1] == a[1][2] == 0 or \
              a[2][0] == a[2][1] == a[2][2] == 0 or \
              a[0][0] == a[1][0] == a[2][0] == 0 or \
              a[0][1] == a[1][1] == a[2][1] == 0 or \
              a[0][2] == a[1][2] == a[2][2] == 0 or \
              a[0][0] == a[1][1] == a[2][2] == 0 or \
              a[0][2] == a[1][1] == a[2][0] == 0:
            print('Victory player 0!')
            exit()

        if a[0][0] == a[0][1] == a[0][2] == 1 or \
              a[1][0] == a[1][1] == a[1][2] == 1 or \
              a[2][0] == a[2][1] == a[2][2] == 1 or \
              a[0][0] == a[1][0] == a[2][0] == 1 or \
              a[0][1] == a[1][1] == a[2][1] == 1 or \
              a[0][2] == a[1][2] == a[2][2] == 1 or \
              a[0][0] == a[1][1] == a[2][2] == 1 or \
              a[0][2] == a[1][1] == a[2][0] == 1:
            print('Victory player 1!')
            exit()

        else:
            print('Draw!')
        exit()
