# Задание 1:
# Необходимо вывести на экран числа от 5 до 1 с помощью цикла for.
# На экране должно быть: 5 4 3 2 1

list_num = [5, 4, 3, 2, 1]
for value in list_num:
    print(value)
