# Вывести таблицу умножения на 3 с помощью цикла for.

for num in range(1, 11):
    result = num * 3
    print(f'{3}*{num}={result}')
