# Вывести таблицу умножения на 3 с помощью цикла for.

for i in list(range(1, 11)):
    j = i * 3
    print(f'{3}*{i}={j}')
