# 1 Вывести на экран строку "Hello world"
# 2 Вывести на экран пять звездочек (*)
# 3 Задание со звездочкой:
# Вывести на экран квадрат 5 на 5 заполненный символами '#'


print('Hello world\n')  # 1

print('*\n' * 5)  # 2

per = '#  ' * 5
print((per + '\n') * 5)  # 3



