# 2 Дан многомерный список. Вывести на экран все четные столбцы,
# у которых первый элемент больше последнего.
# исходный список
# [1 6 8 5 4 0 3]
# [5 7 8 9 4 2 1],
# [6 0 7 8 1 2 5],
# [5 7 2 7 5 2 1]

# результат работы кода с задания 2
# 8 3
# 8 1
# 7 5
# 2 1

a = [
    [1, 6, 8, 5, 4, 0, 3],
    [5, 7, 8, 9, 4, 2, 1],
    [6, 0, 7, 8, 1, 2, 5],
    [5, 7, 2, 7, 5, 2, 1]
    ]

for i in range(len(a)):
    print()
    for j in range(len(a[i])):
        if j % 2 == 0 and a[0][j] > a[-1][j]:
            print(a[i][j], end=' ')
